Джира/src/InformationRegisters/Центр_ДедлайнЗадач/Центр_ДедлайнЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_ДедлайнЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Дедлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПереноса</name>
    <type>
      <types>CatalogRef.Центр_ПричинаПереносаДедлайна</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/InformationRegisters/Центр_ДедлайнЗадач/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьЗаписьСогласования(Задача, Согласующий, Дедлайн, КомментарийОценки, 
	ПричинаПереноса = Неопределено) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.КомментарийОценки = КомментарийОценки;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Согласующий = Согласующий;
	МенеджерЗаписи.Согласовант = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Дедлайн = Дедлайн;
	Если ПричинаПереноса <> Неопределено Тогда
		МенеджерЗаписи.ПричинаПереноса = ПричинаПереноса;
	КонецЕсли;
	МенеджерЗаписи.Записать();
КонецПроцедуры

Процедура ИзменитьПоследнююЗаписьПоЗадаче(Задача, Отказ, Согласовано, КомментарийОтказа = Неопределено) Экспорт
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Задача.Установить(Задача);
	Набор.Прочитать();
	Запись = Набор[Набор.Количество() - 1];
	Запись.Согласовано = Согласовано;
	Запись.Отказ = Отказ;
	Если КомментарийОтказа <> Неопределено Тогда
		Запись.КомментарийОтказа = КомментарийОтказа;
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли
